Repository: fieldcure/fieldcure-assiststudio
Catalog: src/AssistStudio/Strings/*/Resources.resw
Source language: en_us
Languages: ko_kr

# McpCard_Reconnect.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Reconnect
ko_kr: 재연결

# McpCard_Delete.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Remove server
ko_kr: 서버 제거

# McpCard_Delete.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Remove
ko_kr: 제거

source: Delete model
ko_kr: 모델 삭제

# ModelDialog_DeleteBtn.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Delete
ko_kr: 삭제

source: Download model
ko_kr: 모델 다운로드

# ModelDialog_DownloadBtn.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Download
ko_kr: 다운로드

source: Add profile
ko_kr: 프로필 추가

source: Delete profile
ko_kr: 프로필 삭제

# Models_RemoveKey.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Remove API key
ko_kr: API 키 삭제

source: Check status
ko_kr: 상태 확인

# AppTasks_EmbeddingTitle.Text
source: Embedding
ko_kr: 임베딩

# AppTasks_EmbeddingDescription.Text
source: Used for Knowledge Base document indexing and search. Requires an OpenAI-compatible embedding API (Ollama, OpenAI, etc.)
ko_kr: 지식베이스 문서 인덱싱 및 검색에 사용됩니다. OpenAI 호환 임베딩 API가 필요합니다 (Ollama, OpenAI 등)

# AppTasks_EmbeddingProvider.Header
source: Embedding provider
ko_kr: 임베딩 제공자

# Connect_AddKbFolder
source: Add KB Folder
ko_kr: 보관소 폴더 추가

# Connect_KnowledgeBaseDescription
source: Reference documents for semantic search.
ko_kr: 의미 검색을 위한 참조 문서입니다.

# Connect_RagActiveInstances
source: Shared across all conversations.
ko_kr: 모든 대화에서 공유됩니다.

# Connect_RagActiveCount
source: {0} active instance(s)
ko_kr: {0}개 활성 인스턴스

# Connect_RagNeedsFolders
source: Create a knowledge base in Settings to activate.
ko_kr: 설정에서 지식베이스를 생성하면 활성화됩니다.

# Connect_EmbeddingNotConfigured
source: Embedding provider not configured.
ko_kr: 임베딩 제공자가 설정되지 않았습니다.

# Connect_Configure
source: Configure
ko_kr: 설정

# Connect_Reindex
source: Re-index all documents
ko_kr: 전체 문서 재인덱싱

# Connect_KnowledgeBaseTitle
source: Knowledge Base
ko_kr: 지식베이스

# Connect_KnowledgeBaseIndexing
source: Indexing documents…
ko_kr: 문서 인덱싱 중…

# Connect_KnowledgeBaseReindexing
source: Re-indexing documents…
ko_kr: 문서 재인덱싱 중…

# Connect_KnowledgeBaseReady
source: Knowledge Base — Ready
ko_kr: 지식베이스 — 준비됨

# Connect_KnowledgeBaseFailed
source: Knowledge Base — Failed
ko_kr: 지식베이스 — 실패

# Connect_KnowledgeBaseCancelled
source: Indexing cancelled.
ko_kr: 인덱싱이 취소되었습니다.

# Connect_EmbeddingModelHint
source: Make sure an embedding model is loaded: ollama pull nomic-embed-text
ko_kr: 임베딩 모델이 로드되어 있는지 확인하세요: ollama pull nomic-embed-text

# Connect_EmbeddingSettings
source: Embedding settings
ko_kr: 임베딩 설정

# Profiles_KnowledgeHint
source: Select a knowledge base in conversations.
ko_kr: 대화에서 지식베이스를 선택하세요.

# Profiles_OutboxHint
source: Send messages via Slack, Telegram, email, and KakaoTalk.
ko_kr: Slack, Telegram, 이메일, KakaoTalk으로 메시지를 보냅니다.

# Connect_OutboxDescription
source: Add messaging channels and send messages through AI conversations.
ko_kr: AI와의 대화에서 메시지 채널을 추가하고 메시지를 보냅니다.

# Profiles_RunnerHint
source: Schedule AI tasks to run automatically.
ko_kr: AI 작업을 예약하고 자동으로 실행할 수 있습니다.

# Connect_RunnerDescription
source: Schedule and run AI tasks automatically on a timer.
ko_kr: AI 작업을 예약하고 자동으로 실행할 수 있습니다.

# Connect_EssentialsDescription
source: Fetch web pages, run commands, and manage memory in conversations.
ko_kr: 웹 페이지 조회, 명령 실행, 메모리 관리 등 핵심 기능을 제공합니다.

# Connect_SearchEngine
source: Search engine
ko_kr: 검색 엔진

# Connect_SearchEngineFreeHint
source: (free)
ko_kr: (무료)

# Connect_ApiKeyPlaceholder
source: API key
ko_kr: API 키

# Connect_EmbeddingModel
source: Embedding model
ko_kr: 임베딩 모델

# Connect_ChunkContextualization
source: Chunk contextualization
ko_kr: 청크 문맥화

# Connect_ChunkDisabled
source: Disabled
ko_kr: 사용 안 함

# Connect_Channels
source: Channels
ko_kr: 채널

# Connect_Multilingual
source: multilingual
ko_kr: 다국어

# Connect_EmbeddingHint
source: Applied when creating new knowledge archives
ko_kr: 새 지식베이스 생성 시 적용됩니다

# Connect_OutboxNotConnected
source: Unable to load channels
ko_kr: 채널을 불러올 수 없습니다

# Connect_NoChannels
source: No channels configured. Add channels in a conversation.
ko_kr: 설정된 채널이 없습니다.

# Embedding_OllamaNotRunning
source: Ollama is not running. Start with: ollama serve
ko_kr: Ollama가 실행되지 않습니다. ollama serve 명령으로 시작하세요

# Embedding_OpenAiKeyMissing
source: Add an OpenAI API Key in Models first.
ko_kr: Models 페이지에서 OpenAI API Key를 먼저 등록하세요.

# Embedding_Multilingual.Text
source: Multilingual
ko_kr: 다국어

# Embedding_ModelChangeWarning.Title
source: Re-indexing scheduled
ko_kr: 재인덱싱 예약됨

# Embedding_ModelChangeWarning.Message
source: The embedding model has changed. Documents will be re-indexed at the next conversation start.
ko_kr: 임베딩 모델이 변경되었습니다. 다음 대화 시작 시 자동으로 재인덱싱됩니다.

# Embedding_PullTitle
source: Download Model
ko_kr: 모델 다운로드

# Embedding_PullMessage
source: Download {0}? This will run: ollama pull {0}
ko_kr: {0}을(를) 다운로드할까요? ollama pull {0} 명령이 실행됩니다

# Embedding_Downloading
source: {0} downloading…
ko_kr: {0} 다운로드 중…

# Embedding_DownloadComplete
source: {0} ready
ko_kr: {0} 준비 완료

# Embedding_DownloadFailed
source: Download failed
ko_kr: 다운로드 실패

# Contextualizer_Title.Text
source: Chunk Contextualizer
ko_kr: 청크 문맥화

# Contextualizer_Description.Text
source: Adds context descriptions and normalized keywords to each chunk during indexing to improve search accuracy. A small model (3-4B) is sufficient.
ko_kr: 인덱싱 시 각 청크에 문맥 설명과 정규화된 키워드를 부여하여 검색 정확도를 높입니다. 소형 모델(3-4B)이면 충분합니다.

# Contextualizer_Disabled.Text
source: Disabled
ko_kr: 사용 안 함

# Contextualizer_OllamaNotRunning
source: Ollama is not running. Start with: ollama serve
ko_kr: Ollama가 실행되지 않습니다. ollama serve 명령으로 시작하세요

# Contextualizer_OpenAiKeyMissing
source: Add an OpenAI API Key in Models first.
ko_kr: Models 페이지에서 OpenAI API Key를 먼저 등록하세요.

# Contextualizer_ClaudeKeyMissing
source: Add a Claude API Key in Models first.
ko_kr: Models 페이지에서 Claude API Key를 먼저 등록하세요.

# Contextualizer_Downloading
source: {0} downloading…
ko_kr: {0} 다운로드 중…

# Contextualizer_DownloadComplete
source: {0} ready
ko_kr: {0} 준비 완료

# Contextualizer_DownloadFailed
source: Download failed
ko_kr: 다운로드 실패

# Common_Cancel
source: Cancel
ko_kr: 취소

# Common_Error
source: Error
ko_kr: 오류

# Common_OK
source: OK
ko_kr: 확인

# Cron_EveryMinute
source: every minute
ko_kr: 매분

# Cron_EveryHour
source: every hour
ko_kr: 매시간

# Cron_EverySecond
source: every second
ko_kr: 매초

# Cron_AnErrorOccurredWhenGeneratingTheExpressionD
source: An error occurred when generating the expression description. Check the cron expression syntax.
ko_kr: 표현식 설명을 생성하는 중 오류가 발생했습니다. cron 표현식을 확인하세요.

# Cron_AtX0MinutesPastTheHour
source: at {0} minutes past the hour
ko_kr: {0}분

# Cron_AtX0SecondsPastTheMinute
source: at {0} seconds past the minute
ko_kr: {0}초

# Cron_BetweenX0AndX1
source: between {0} and {1}
ko_kr: {0}~{1} 사이

# Cron_EveryMinuteBetweenX0AndX1
source: Every minute between {0} and {1}
ko_kr: {0}~{1} 사이 매분

# Cron_EveryX0Seconds
source: every {0} seconds
ko_kr: {0}초마다

# Cron_EveryX0Minutes
source: every {0} minutes
ko_kr: {0}분마다

# Cron_EveryX0Hours
source: every {0} hours
ko_kr: {0}시간마다

# Cron_SecondsX0ThroughX1PastTheMinute
source: seconds {0} through {1} past the minute
ko_kr: {0}~{1}초

# Cron_MinutesX0ThroughX1PastTheHour
source: minutes {0} through {1} past the hour
ko_kr: {0}~{1}분

# Cron_ComaEveryDay
source: , every day
ko_kr: , 매일

# Cron_ComaEveryMinute
source: , every minute
ko_kr: , 매분

# Cron_ComaEveryHour
source: , every hour
ko_kr: , 매시간

# Cron_ComaEveryX0Days
source: , every {0} days
ko_kr: , {0}일마다

# Cron_ComaEveryX0DaysOfTheWeek
source: , every {0} days of the week
ko_kr: , 주 {0}일마다

# Cron_ComaEveryX0Months
source: , every {0} months
ko_kr: , {0}개월마다

# Cron_ComaEveryX0Years
source: , every {0} years
ko_kr: , {0}년마다

# Cron_ComaOnDayX0OfTheMonth
source: , on day {0} of the month
ko_kr: , 매월 {0}일

# Cron_ComaOnTheX0OfTheMonth
source: , on the {0} of the month
ko_kr: , 매월 {0}

# Cron_ComaOnTheLastDayOfTheMonth
source: , on the last day of the month
ko_kr: , 매월 마지막 날

# Cron_ComaOnTheLastWeekdayOfTheMonth
source: , on the last weekday of the month
ko_kr: , 매월 마지막 평일

# Cron_ComaOnTheLastX0OfTheMonth
source: , on the last {0} of the month
ko_kr: , 매월 마지막 {0}

# Cron_ComaBetweenDayX0AndX1OfTheMonth
source: , between day {0} and {1} of the month
ko_kr: , 매월 {0}~{1}일

# Cron_CommaDaysBeforeTheLastDayOfTheMonth
source: , {0} days before the last day of the month
ko_kr: , 매월 마지막 날 {0}일 전

# Cron_ComaOnlyOnX0
source: , only on {0}
ko_kr: , {0}에만

# Cron_ComaOnlyInX0
source: , only in {0}
ko_kr: , {0}에만

# Cron_ComaOnlyInYearX0
source: , only in {0}
ko_kr: , {0}년에만

# Cron_CommaStartingX0
source: , starting {0}
ko_kr: , {0}부터

# Cron_First
source: first
ko_kr: 첫 번째

# Cron_Second
source: second
ko_kr: 두 번째

# Cron_Third
source: third
ko_kr: 세 번째

# Cron_Fourth
source: fourth
ko_kr: 네 번째

# Cron_Fifth
source: fifth
ko_kr: 다섯 번째

# Cron_FirstWeekday
source: first weekday
ko_kr: 첫 번째 평일

# Cron_WeekdayNearestDayX0
source: weekday nearest day {0}
ko_kr: {0}일에 가장 가까운 평일

# Cron_AMPeriod
source: AM
ko_kr: 오전

# Cron_PMPeriod
source: PM
ko_kr: 오후

# Nav_Schedule.Content
source: Schedule
ko_kr: 스케줄

# Schedule_Title.Text
source: Schedule
ko_kr: 스케줄

# Schedule_Empty.Text
source: No scheduled tasks registered.
ko_kr: 등록된 스케줄이 없습니다.

# Schedule_EmptyHint.Text
source: Say "do this every day at 9am" during a conversation and the AI will create a schedule.
ko_kr: 대화 중 "매일 9시에 ~해줘"라고 말하면 AI가 스케줄을 등록합니다.

# Schedule_Hint.Text
source: Schedules are created during conversations. To edit a schedule, delete it and ask the AI to create a new one.
ko_kr: 스케줄은 대화 중에 생성됩니다. 수정하려면 삭제 후 대화에서 다시 만들어 주세요.

# Schedule_DeleteTooltip
source: Delete
ko_kr: 삭제

# Schedule_DeleteConfirmTitle
source: Delete Schedule
ko_kr: 스케줄 삭제

# Schedule_DeleteConfirmContent
source: Are you sure you want to delete "{0}"?
ko_kr: "{0}" 스케줄을 삭제하시겠습니까?

# Schedule_Loading
source: Loading schedules...
ko_kr: 스케줄을 불러오는 중...

# Schedule_SearchPlaceholder
source: Search schedules...
ko_kr: 스케줄 검색...

# Schedule_EnableTooltip
source: Enable
ko_kr: 활성화

# Schedule_DisableTooltip
source: Disable
ko_kr: 비활성화

# Models_CustomSection.Text
source: Custom providers
ko_kr: 커스텀 프로바이더

# Models_CustomSectionDesc.Text
source: Register OpenAI-compatible API endpoints (e.g., Together AI, OpenRouter).
ko_kr: OpenAI 호환 API 엔드포인트를 등록합니다 (예: Together AI, OpenRouter).

source: Add provider
ko_kr: 프로바이더 추가

# Models_DeleteCustomProvider
source: Delete provider
ko_kr: 프로바이더 삭제

# Models_DeleteCustomProviderConfirmTitle
source: Delete provider
ko_kr: 프로바이더 삭제

# Models_DeleteCustomProviderConfirmMessage
source: This will remove the provider and its API key. Are you sure?
ko_kr: 프로바이더와 API 키가 삭제됩니다. 계속하시겠습니까?

# Models_Delete
source: Delete
ko_kr: 삭제

# Models_Cancel
source: Cancel
ko_kr: 취소

# Models_TypeModelId
source: Type model ID (e.g., MiniMax-M1)
ko_kr: 모델 ID 입력 (예: MiniMax-M1)

# CustomProviderDialog.Title
source: Add custom provider
ko_kr: 커스텀 프로바이더 추가

# CustomProviderDialog.PrimaryButtonText
source: Save
ko_kr: 저장

# CustomProviderDialog.CloseButtonText
source: Cancel
ko_kr: 취소

# CustomProviderDialog_EditTitle
source: Edit provider
ko_kr: 프로바이더 편집

# CustomProviderDialog_DisplayName.Header
source: Display name
ko_kr: 표시 이름

# CustomProviderDialog_DisplayName.PlaceholderText
source: e.g., Together AI
ko_kr: 예: Together AI

# CustomProviderDialog_BaseUrl.Header
source: Base URL
ko_kr: 기본 URL

# CustomProviderDialog_BaseUrlHint.Text
source: Do not include /chat/completions path.
ko_kr: /chat/completions 경로를 포함하지 마세요.

# Memory_SearchBox.PlaceholderText
source: Search memories...
ko_kr: 메모리 검색...

# Schedule_SearchBox.PlaceholderText
source: Search schedules...
ko_kr: 스케줄 검색...

# KB_SearchBox.PlaceholderText
source: Search documents...
ko_kr: 문서 내용 검색...
